<a href="https://colab.research.google.com/github/kk00b/ds-admission-challenge/blob/master/ds_bootcamp_admission_challenge_jiyeon_kim.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Challenge

- 코드스테이츠 DS 부트캠프 어드미션을 위한 Challenge 과제 입니다. 
- 아래 challenge 를 풀기 위해 제공된 강의가 모든 것을 알려주진 않습니다. 
- 따라서 필요한 부분은 스스로 google 검색을 통해 이 challenge 를 완성해 주셔야 합니다. 
- 각 shell 에 필요한 부분을 작성하신 후 함께 링크를 제출해 주시면 됩니다.
- 모든 결과물은 하나의 shell에서 모두 실행될 수 있도록 print문을 사용해 주세요. run all 했을 때 전체 shell 이 모두 잘 실행될 수 있도록 관리해 주세요.

In [89]:
# 1. 다음의 list 에서 두 번째 list elemnet 를 print 해 보세요
list_01 = ['Paul', 'John', 'Ringo', 'George']

print(list_01[1])

John

In [90]:
# 2. 다음의 list in the list에서 두 번째 element 를 print 해 보세요
list_02 = [['Paul', 'John', 'Ringo', 'George']]
print(list_02[0][1])

John

In [91]:
# Initializing list  
list_01 = [ 1, 6, 3, 5, 3, 4 ] 
list_02 = [ 1, 6, 3, 5, 3 ] 
 
# for loop을 이용하여 두 개의 리스트 안에 4가 있는지 없는지 print 하는 코드를 작성하세요

sum = 0

for i in list_01:
  if i == 4:
    sum =+ 1.     # element가 4인 경우 sum + 1을 하여 숫자를 세준다.
if sum >= 1:      # for문에서 element를 센 뒤 sum이 0보다 큰 지 확인하여 문구 출력
  print("4가 있습니다.")

else:
  print("4가 없습니다.")

sum = 0
for i in list_02:
  if i == 4:
    sum =+ 1
  

if sum >= 1:
  print("4가 있습니다.")

else:
  print("4가 없습니다.")

4가 있습니다.
4가 없습니다.

In [92]:
# 위 코드 역할을 하는 함수를 작성해 보세요
def find_four(list_name):
  sum = 0
  for i in list_name:
    if i == 4:
      sum =+ 1
    
  if sum >= 1:
    print("4가 있습니다.")

  else:
    print("4가 없습니다.")

In [93]:
list_03 = [4, 5, 8, 9, 10] 
# 위 list element 중 8보다 큰 숫자가 몇 개가 있는지 코드로 작성해 보세요. 
list_04 = []
for i in list_03:
  if i > 8:
    list_04.append(i)  # 8보다 큰 숫자들을 새로운 리스트에 넣어준다.


print(len(list_04)) # 8보다 큰 숫자들의 리스트의 길이를 출력

2

In [94]:
# BMI
height = [1.87,  1.87, 1.82, 1.91, 1.90, 1.85]
weight = [81.65, 97.52, 95.25, 92.98, 86.18, 88.45]

# bmi = weight / height ** 2 를 numpy array 활용하여 구해보세요
import numpy as np

h = np.array(height)
w = np.array(weight)

bmi = w / h ** 2

print(bmi)

# bmi 가 24 이상인 값들만 선택해 보세요
bmi_over_24 = []
for i in bmi:
  if i >= 24:
    bmi_over_24.append(i)

print(bmi_over_24)

[23.34925219 27.88755755 28.75558507 25.48723993 23.87257618 25.84368152]
[27.887557550973714, 28.755585074266392, 25.48723993311587, 25.843681519357194]

In [98]:
# pandas 패키지 라이브러리를 불러오세요

import pandas as pd

# 아래 내용을 담는 pandas Dataframe 을 생성하세요
# {'Bob': ['I liked it.', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']}
data = {
    'Bob': ['I liked it.', 'It was awful.'],
    'Sue': ['Pretty good.', 'Bland.']
}

pd.DataFrame.from_dict(data)

             Bob           Sue
0    I liked it.  Pretty good.
1  It was awful.        Bland.

In [99]:
# 아래와 같은 dataframe을 만들어 보세요. (참고: 연도가 index가 되게 해 주세요)
"""
year dept     revenue
2015 Sales    30
2016 Sales    35
2017 Sales    40
"""

data = {
    "year": (2015, 2016, 2017),
    "dept": ("Sales", "Sales", "Sales"),
    "revenue": (30, 35, 40)
}

df = pd.DataFrame.from_dict(data)


df.set_index('year')


# 2017년 데이터만 선택해 보세요
# df.iloc(2)  ValueError: No axis named 2 for object type <class 'pandas.core.frame.DataFrame'>

# 조건(condition)을 활용하여 revenue 30 이상으로만 filter 해 보세요. reference: https://pandas.pydata.org/pandas-docs/stable/getting_started/intro_tutorials/03_subset_data.html 

above_30 = df[df["revenue"] > 30]

print(above_30)

   year   dept  revenue
1  2016  Sales       35
2  2017  Sales       40

In [69]:
# 'https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv' 자료를 불러와 dataframe으로 만들어 보세요 


titanic = pd.read_csv("https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv")

     Survived  Pclass  ... Parents/Children Aboard     Fare
0           0       3  ...                       0   7.2500
1           1       1  ...                       0  71.2833
2           1       3  ...                       0   7.9250
3           1       1  ...                       0  53.1000
4           0       3  ...                       0   8.0500
..        ...     ...  ...                     ...      ...
882         0       2  ...                       0  13.0000
883         1       1  ...                       0  30.0000
884         0       3  ...                       2  23.4500
885         1       1  ...                       0  30.0000
886         0       3  ...                       0   7.7500

[887 rows x 8 columns]

In [100]:
titanic = pd.read_csv("https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv")
# 타이타닉 데이터의 shape은 어떻게 되나요? 
titanic.shape
# 타이타닉 row record에서 10~20번째 줄을 출력해 보세요
titanic[10:21]
# 타이타닉 데이터에서 'Survived', 'Age', 'Sex' 칼럼 데이터를 선택해 보세요 
titanic[['Survived', 'Age', 'Sex']] # 검색키워드 : dataframe select multiple columns

# 타이타닉 데이터에서 생존자 데이터만 골라보세요
survived_one = titanic.loc[titanic['Survived'] == 1]   # keyword : dataframe select specific value
print(survived_one)


# 생존자 데이터 중 여자, 남자 중 누가 더 많나요? 참고: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.value_counts.html
print(survived_one['Sex'].value_counts())

     Survived  Pclass  ... Parents/Children Aboard     Fare
1           1       1  ...                       0  71.2833
2           1       3  ...                       0   7.9250
3           1       1  ...                       0  53.1000
8           1       3  ...                       2  11.1333
9           1       2  ...                       0  30.0708
..        ...     ...  ...                     ...      ...
871         1       3  ...                       0   7.2250
875         1       1  ...                       1  83.1583
876         1       2  ...                       1  26.0000
883         1       1  ...                       0  30.0000
885         1       1  ...                       0  30.0000

[342 rows x 8 columns]
female    233
male      109
Name: Sex, dtype: int64